
#include <iostream> //Библиотека за вход и изход
#include <cstdlib> //Библиотка, която се използва за srand u rand
#include <ctime> //Библиотека за работа с времето на компютъра
using namespace std;

int main() //Главна функция на програмата.Всяка програма трябва да има точно една main-функция
{ //Задължитлно се слага печупена скоба преди да започнем тялото на програмата//
    srand(time(0)); //seed random number generator
    int num = rand() % 100 + 1; //Декларираме променливата "num", която е числото, което трябва да се познае,трябва да бъде от 1 до 100//
    cout << "Guess My Number Game\n\n"; //На конзолата се извежда надпис "Игра-познай числото ми"//

    int guess = 0;//Декларираме променлива,в която ще се съдържа стойността на всяко предположение, задаваме й първоначална стойност нула//
    while (guess != num) { //Задаваме цикъл "while",който да работи докато "guess" e различно от "num"//
        cout << "Enter a guess between 1 and 100 : "; //На конзолата се извежда надпис "Въведете предположение от 1 до 100",това са допустимите стойности//
        cin >> guess; //От клавиатурата се въвежда променливата "guess" oт 1 до 100//

        if (guess > num) { //Чрез оператора "if-else" проверяваме дали предположението (guess) e по-голямо от намисленото число (num)//
            cout << "Too high!\n\n";//На екрана да се изведе "Прекалено високо!", ако guess>num//
        } //Задължителна пречупена скоба след "if"//
        else if (guess < num) //Проверяме другия случай чрез "else" дали предположението не е по-малко от намисленото число//
            { //След оператора "if-else" следват пречупени скоби//
                cout << "Too low!\n\n";//Ако guess<num,на екрана да се изведе текст "Прекалено малко!"//
            } //Затваряне на пречупените скоби след "if-else"//
        else { //Използваме "else",за да разгледаме последния случай-ако предположението е вярно//
            cout << "\nCorrect! You got it in "; //Ако предположението е вярно, на екрана да се изведе текст "Вярно!Позна"
        } //Задължителна пречупена скоба след "else"//
    } //Затваряме цикъла "while" с пречупена скоба//

    return 0; //Връща резултат нула на опрерационната система
} //Винаги завършваме тялото на програмата с пречупена скоба//
